app/views/usuarios/_form.html.erb

SELECT `grupos`.* FROM `grupos`
---
      <%= f.label :grupo %>
      <%= f.collection_select(:grupo_id, Grupo.all, :id, :descricao, :prompt => true)  %>