app/controllers/grupos_controller.rb

SELECT `grupos`.* FROM `grupos`
---
  def index
    @grupos = Grupo.all

SELECT `grupos`.* FROM `grupos` WHERE `grupos`.`id` = 1 LIMIT 1
---
  def show
    @grupo = Grupo.find(params[:id])

SELECT `grupos`.* FROM `grupos` WHERE `grupos`.`id` = 1 LIMIT 1
---
  def edit
    @grupo = Grupo.find(params[:id])

INSERT INTO `grupos` (`created_at`, `descricao`, `multa`, `updated_at`) VALUES ('2012-06-29 02:56:18', 'teste', 44.0, '2012-06-29 02:56:18')
---
  def create
    @grupo = Grupo.new(params[:grupo])

    respond_to do |format|
      if @grupo.save

SELECT `grupos`.* FROM `grupos` WHERE `grupos`.`id` = 1 LIMIT 1
UPDATE `grupos` SET `updated_at` = '2012-06-29 03:19:42', `descricao` = 'Alunos', `multa` = 5.0 WHERE `grupos`.`id` = 1
---
  def update
    @grupo = Grupo.find(params[:id])

    respond_to do |format|
      if @grupo.update_attributes(params[:grupo])